---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.CuttingFailures
source: html/af32aef8-bd02-d76c-ca49-8fadf6239b7b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CuttingFailures

Failures about Cutting.

## Syntax (C#)
```csharp
public static class CuttingFailures
```